ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_НумераторПоПеревозчикам/ЖБИ_НумераторПоПеревозчикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_НумераторПоПеревозчикам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДокументПеревозчика</name>
    <type>
      <types>DocumentRef.ЖБИ_ДоговорЗаявка</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорПеревозки</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_НумераторПоПеревозчикам/ManagerModule.bsl
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

Функция ПолучитьПустуюТаблицуНаборЗаписей() Экспорт
	
	НаборЗаписей 		= РегистрыСведений.ЖБИ_НумераторПоПеревозчикам.СоздатьНаборЗаписей();	
	ТаблПлановыхСтавок 	= НаборЗаписей.ВыгрузитьКолонки();
	
	Возврат ТаблПлановыхСтавок;
	
КонецФункции

Функция СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,СписокСвойствОбновления,СтруктураПоиска = Неопределено,СообщениеОбОшибке) Экспорт
	
	Для Каждого СтрокаНабораЗаписей Из ТаблицаНабораЗаписей Цикл	
		
		НаборЗаписей = РегистрыСведений.ЖБИ_НумераторПоПеревозчикам.СоздатьНаборЗаписей();
		
		Отбор = НаборЗаписей.Отбор;
		Период = ?(ЗначениеЗаполнено(СтрокаНабораЗаписей.Период), СтрокаНабораЗаписей.Период, ТекущаяДата()); 
		Отбор.Период.Установить(Период);
		Отбор.Партнер.Установить(СтрокаНабораЗаписей.Партнер);
		Отбор.ДоговорПеревозки.Установить(СтрокаНабораЗаписей.ДоговорПеревозки);
		Если СтруктураПоиска<>Неопределено Тогда
			Для Каждого Ном Из СтруктураПоиска Цикл 
				Отбор[Ном.Ключ].Установить(Ном.Значение);	
			КонецЦикла;
		КонецЕсли;		
		НаборЗаписей.Прочитать();	
		Если НаборЗаписей.Количество() > 0 Тогда
			Для Каждого Запись Из НаборЗаписей Цикл				
				Если СписокСвойствОбновления = Неопределено Тогда 
					ЗаполнитьЗначенияСвойств(Запись, СтрокаНабораЗаписей);
				Иначе
					ЗаполнитьЗначенияСвойств(Запись, СтрокаНабораЗаписей, СписокСвойствОбновления);
				КонецЕсли;		
			КонецЦикла;		
			Попытка
				НаборЗаписей.Записать(Истина);
			Исключение
				СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Прервать;
			КонецПопытки;;
		Иначе 
			МенеджерЗаписи = РегистрыСведений.ЖБИ_НумераторПоПеревозчикам.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,СтрокаНабораЗаписей);			
			Попытка
				МенеджерЗаписи.Записать(Истина);
			Исключение
				СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Прервать;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;	
								
	Возврат ?(ПустаяСтрока(СообщениеОбОшибке),Истина,Ложь);
	
КонецФункции

Функция ЗаполнитьТаблицуНабораЗаписей(СтруктураПараметров) Экспорт 
	
	ТаблицаНабораЗаписей = ПолучитьПустуюТаблицуНаборЗаписей();
	НоваяСтр = ТаблицаНабораЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтр,СтруктураПараметров);
	
	Возврат ТаблицаНабораЗаписей;
	
КонецФункции


#КонецОбласти
